{
  "translation": {
    "home": {
      "sub": "Full Stack Web Developer",
      "section1Title": "Expreienced",
      "section1Content1": "In my most recent role as a Senior Full Stack Developer at pharmaceutical tech startup Faro Health I worked on REST and CQRS based microservices and UI modules implemented in Typescript, Node, PostgreSQL, Jest and React. My work involved developing feature slices and POCs, creating and executing technical designs, writing Unit and Integration Tests, optimizing application performance, and building deployment pipelines using Github Actions.",
      "section1Content2": "Prior to this, I led an international remote Front End team at Various Inc. where we worked hand in hand with the design team to reskin and migrate legacy Javascript and Perl based video streaming apps to a modern UI built in React, TypeScript and Python. A more scalable codebase utilizing Next.js, MOBX and WebSockets and backed by REST APIs and a CI/CD development pipeline to streamline deployment.",
      "section2Title": "Technical Leader",
      "section2Content1": "Having led a large international team of developers and engineers in the US, Europe, Taiwan and China I'm positive that my expertise in technologies like Typescript, Node, PostgreSQL, Jest and React will help to push your organization forward. In addition to my technical design and development skills, my leadership abilities will help to align and focus team efforts towards specific milestones, and company defined goals."
    },
    "about": {
      "section1": "Brian is an experienced Senior Developer with a passion for elegant scalable code, and minimal intuitive UX.",
      "section2": "In his spare time he loves to climb, play chess, explore on his dirtbike, and practice Muay Thai."
    },
    "nav": {
      "home": "Home",
      "skills": "Skills",
      "projects": "Projects",
      "about": "About",
      "jobs": "Jobs"
    },
    "data": {
      "projects": {
        "description": {
          "1": "A clinical trial software tool that helps investigators design and optimize their clinical studies by providing real-time analytics and streamlining the planning process.",
          "2": "A realtime video streaming and chat application",
          "3": "A survey and informational website about upcoming changes to for the city of San Anselmo",
          "4": "Website for a web design and development agency",
          "5": "Proof of concept Data Analytics micro-service app built in Pandas",
          "6": "An IDP agnostic Single Sign On implementation for the study designer application.",
          "7": "Website for a AI used car application.",
          "8": "Front end for a showcase application for a Geometric application for combining lattice structures."
        },
        "content": {
          "1": "<div><h3>Utilizing AI for clinical study development.</h3><p>The company's flagship product, the Faro Study Designer, is designed to enhance the efficiency and patient-friendliness of clinical protocols.</p><p>Faro Health has received significant investment, securing a total of $38.3 million in funding, with the most recent $20 million raised approximately two years ago.</p><p>Key features include:</p><div><p>Real-time Collaboration: Facilitates accurate and efficient documentation processes.</p><p>Feasibility Analysis: Assesses the impact of design decisions on study success rates.</p><p>Benchmarking: Compares protocols with historical data and design variations.</p></div></div>",
          "2": "<div><p>The Viewer is an interactive webcam platform where users can engage in live video chats with performers, offering a real-time, personalized experience. The platform allows users to view live broadcasts, participate in private sessions, and connect with performers through video, audio, and chat features. </p> </div>",
          "4": "<div><p>Launch Brigade is a web design and development agency based in the San Francisco Bay Area, specializing in creating digital experiences that elevate brands and drive business growth. Their website, launchbrigade.com, reflects their commitment to delivering comprehensive digital solutions.</p></div>",
          "5": "<div><p>The Data Analytics Dashboard was a proof of concept application built in Pandas which utilized Study Design data stored in a star schema to create a data analytics microservice and frontend. This app allowed users to slice and dice their study data according to whatever data dimensions they chose.</p></div>",
          "7": "<div><p>Lotlinx is an AI-driven automotive inventory management platform that leverages machine learning and extensive data analytics to help dealerships optimize inventory turnover and profitability. By providing real-time insights into market demand, pricing strategies, and consumer behavior, Lotlinx enables use car dealers to make data-driven decisions, reduce holding costs, and enhance overall operational efficiency.</p></div>",
          "8": "<div><p>​Metafold 3D is a cloud-based platform that enables the design and engineering of highly complex 3D models, specifically optimized for additive manufacturing. Founded in 2020 by experts in mathematics, geometry, and architecture, Metafold addresses the challenges traditional CAD tools face when handling intricate geometries, such as lattice structures, which are essential for lightweight and efficient designs​Metafold 3D is a cloud-based platform that enables the design and engineering of highly complex 3D models, specifically optimized for additive manufacturing. Metafold addresses the challenges traditional CAD tools face when handling merging intricate geometries, such as lattice structures.</p></div>"
        }
      }
    }
  }
}
