{
  "translation": {
    "home": {
      "header": "<span>¡Hola!<br /> Soy Brian Velasquez,<br /><em>Ingeniero Senior Full Stack</em></span>",
      "aboutHeader": "¿Quién soy?",
      "about": "Desarrollador web Full-Stack Senior con experiencia en TypeScript, React, Angular, Node.js y Python. Experiencia liderando equipos internacionales, modernizando sistemas heredados, optimizando arquitecturas e implementando pipelines de CI/CD para despliegues eficientes. Apasionado por construir soluciones escalables y centradas en el usuario que impulsen el crecimiento empresarial.",
      "section1Title": "Experimentado",
      "section1Content1": "En mi rol más reciente como Desarrollador Full-Stack Senior en la startup farmacéutica Faro Health, construí y optimicé microservicios basados en REST y CQRS, así como módulos de interfaz de usuario utilizando TypeScript, Node.js, PostgreSQL, Jest y React. Desarrollé fragmentos de características y pruebas de concepto, diseñé y ejecuté soluciones técnicas, escribí pruebas unitarias y de integración, optimicé el rendimiento de la aplicación y construí pipelines de despliegue con GitHub Actions.",
      "section1Content2": "Anteriormente, lideré un equipo remoto internacional de front-end en Various Inc., colaborando estrechamente con diseñadores para modernizar aplicaciones de transmisión de video basadas en JavaScript y Perl. Migramos estas aplicaciones a una pila escalable y de alto rendimiento con React, TypeScript, Next.js, MOBX, WebSockets y Python, respaldada por APIs REST y un pipeline de CI/CD para despliegues sin problemas.",
      "section2Title": "Líder Técnico",
      "section2Content1": "Habiendo liderado un equipo internacional extenso en EE.UU., Europa, Taiwán y China, aporto una profunda experiencia en TypeScript, Node.js, PostgreSQL, Jest y React para impulsar la innovación. Más allá del diseño y desarrollo técnico, mis habilidades de liderazgo aseguran que los equipos se mantengan alineados, enfocados y trabajando hacia los hitos clave y los objetivos de la empresa."
    },
    "about": {
      "section1": "Brian es un desarrollador senior experimentado con pasión por el código escalable y elegante y las experiencias de usuario mínimas e intuitivas.",
      "section2": "En su tiempo libre le encanta escalar, jugar al ajedrez, explorar en su moto de cross y practicar Muay Thai."
    },
    "lang": {
      "english": "Inglés",
      "chinese": "Chino",
      "espanol": "Español",
      "thai": "Tailandés",
      "german": "Alemán",
      "korean": "Coreano"
    },
    "nav": {
      "home": "Inicio",
      "skills": "Habilidades",
      "projects": "Proyectos",
      "about": "Acerca de",
      "jobs": "Trabajos"
    },
    "jobs": {
      "content": {
        "5": "",
        "4": "",
        "3": "",
        "2": "",
        "1": ""
      }
    },
    "data": {
      "projects": {
        "description": {
          "1": "Una herramienta de software para ensayos clínicos para planificar, diseñar y optimizar estudios con análisis en tiempo real.",
          "2": "Una aplicación de transmisión de video en tiempo real y chat.",
          "3": "Un sitio web de encuestas e información sobre los próximos cambios para la ciudad de San Anselmo.",
          "4": "Sitio web para una agencia de diseño y desarrollo web.",
          "5": "Prueba de concepto de una aplicación microservicio de análisis de datos construida en Python y Pandas.",
          "6": "Una implementación de inicio de sesión único (SSO) independiente del proveedor de identidad (IDP) para la aplicación de diseño de estudios.",
          "7": "Sitio web para una aplicación de autos usados basada en IA.",
          "8": "Interfaz de usuario para una aplicación de demostración de una aplicación geométrica para combinar estructuras de celosía."
        },
        "content": {
          "1": "<div><h3>Utilización de IA para el desarrollo de estudios clínicos.</h3><p>El producto insignia de la compañía, Faro Study Designer, está diseñado para mejorar la eficiencia y la experiencia del paciente en los protocolos clínicos.</p><p>Faro Health ha recibido una inversión significativa, asegurando un total de $38.3 millones, con $20 millones recaudados hace aproximadamente dos años.</p><p>Características clave incluyen:</p><ul><li>Colaboración en tiempo real: Facilita procesos de documentación precisos y eficientes.</li><li>Análisis de factibilidad: Evalúa el impacto de las decisiones de diseño en las tasas de éxito del estudio.</li><li>Benchmarking: Compara protocolos con datos históricos y variaciones de diseño.</li></ul></div>",
          "2": "<p>El Viewer es una plataforma interactiva de cámaras web donde los usuarios pueden participar en chats de video en vivo con los presentadores, ofreciendo una experiencia personalizada y en tiempo real. La plataforma permite ver transmisiones en vivo, participar en sesiones privadas y conectarse a través de video, audio y chat.</p>",
          "3": "<p>Un sitio web en WordPress para la Actualización del Plan General 2025 de San Anselmo, que brinda a los residentes información detallada sobre los cambios propuestos en la infraestructura, la zonificación y los espacios públicos de la ciudad. También incluye encuestas interactivas para recopilar opiniones de la comunidad.</p>",
          "4": "<p>Launch Brigade es una agencia de diseño y desarrollo web con sede en el Área de la Bahía de San Francisco, especializada en crear experiencias digitales que mejoran las marcas y fomentan el crecimiento empresarial. Su sitio web, launchbrigade.com, refleja su compromiso con soluciones digitales integrales.</p>",
          "5": "<p>El Panel de Análisis de Datos fue una prueba de concepto construida en Pandas que utilizaba datos de diseño de estudios almacenados en un esquema estrella para crear un microservicio de análisis de datos y frontend. Este app permitía a los usuarios segmentar y analizar sus datos de estudio según las dimensiones elegidas.</p>"
        }
      }
    }
  }
}
