{
  "translation": {
    "home": {
      "sub": "전체 스택 웹 개발자",
      "section1Title": "전직",
      "section1Content1": "제약 기술 스타트업 Faro Health의 선임 풀 스택 개발자로서 가장 최근의 역할에서 저는 REST 및 CQRS 기반의 마이크로 서비스 및 UI 모듈을 TypeScript, Node, PostgreSQL, Jest 및 React에서 구현했습니다. ",
      "section1Content2": "그 전에는 Variver Inc.에서 국제 원격 프론트 엔드 팀을 이끌었습니다. 여기서 우리는 디자인 팀과 함께 레거시 JavaScript 및 Perl 기반 비디오 스트리밍 앱을 반응, TypeScript 및 Python으로 내장 된 최신 UI로 마이그레이션하고 마이그레이션했습니다. ",
      "section2Title": "기술 리더",
      "section2Content1": "미국, 유럽, 대만 및 중국에서 대규모 국제 개발자 및 엔지니어 팀을 이끌면서 TypeScript, Node, PostgreSQL, Jest 및 React와 같은 기술에 대한 전문 지식이 조직을 발전시키는 데 도움이 될 것입니다. "
    },
    "about": {
      "section1": "Brian은 우아한 확장 가능한 코드에 대한 열정과 최소 직관적 인 UX에 대한 열정을 가진 숙련 된 선임 개발자입니다.",
      "section2": "여가 시간에 그는 올라가고 체스를하고, 더트 바이크를 탐험하고, Muay Thai를 연습하는 것을 좋아합니다."
    },
    "nav": {
      "home": "홈페이지",
      "skills": "기술",
      "projects": "프로젝트",
      "about": "에 대한",
      "jobs": "일자리"
    },
    "data": {
      "projects": {
        "description": {
          "1": "조사관이 실시간 분석을 제공하고 계획 프로세스를 간소화하여 임상 연구를 설계하고 최적화하는 데 도움이되는 임상 시험 소프트웨어 도구.",
          "2": "실시간 비디오 스트리밍 및 채팅 응용 프로그램",
          "3": "San Anselmo시의 향후 변경 사항에 대한 설문 조사 및 정보 웹 사이트",
          "4": "웹 디자인 및 개발 대행사를위한 웹 사이트",
          "5": "컨셉 데이터 분석 증명 팬더로 내장 된 마이크로 서비스 앱",
          "6": "연구 디자이너 응용 프로그램을위한 IDP 불가지론자 단일 사인.",
          "7": "AI 중고차 응용 프로그램을위한 웹 사이트.",
          "8": "격자 구조를 결합하기위한 기하학적 애플리케이션을위한 쇼케이스 애플리케이션의 프론트 엔드."
        },
        "content": {
          "1": "<div><h3>임상 연구 개발을 위해 AI 사용.</h3><p>이 회사의 주력 제품인 Faro Study Designer는 임상 프로토콜의 효율성과 환자 친화 성을 향상 시키도록 설계되었습니다.</p><p>Faro Health는 상당한 투자를 받았으며 총 3,830 만 달러의 자금을 확보했으며, 가장 최근 2 천만 달러는 약 2 년 전 증가했습니다.</p><p>주요 기능은 다음과 같습니다.</p><div><p>실시간 협업 : 정확하고 효율적인 문서 프로세스를 용이하게합니다.</p><p>타당성 분석 : 설계 결정이 학습 ​​성공률에 미치는 영향을 평가합니다.</p><p>벤치마킹 : 프로토콜을 과거 데이터 및 설계 변형과 비교합니다.</p></div></div>",
          "2": "<div><p>뷰어는 사용자가 공연자와 라이브 화상 채팅을 할 수있는 대화식 웹캠 플랫폼으로 실시간의 개인화 된 경험을 제공합니다.  </p> </div>",
          "4": "<div><p>Launch Brigade는 샌프란시스코 베이 지역에 본사를 둔 웹 디자인 및 개발 대행사로 브랜드를 높이고 비즈니스 성장을 이끌어내는 디지털 경험을 전문으로합니다. </p></div>",
          "5": "<div><p>데이터 분석 대시보드 Pandas에 내장 된 개념 증명서 응용 프로그램으로 Star Schema에 저장된 연구 설계 데이터를 사용하여 데이터 분석 마이크로 서비스 및 Frontend를 생성했습니다. </p></div>",
          "7": "<div><p>Lotlinx는 기계 학습 및 광범위한 데이터 분석을 활용하여 대리점이 인벤토리 회전율 및 수익성을 최적화 할 수 있도록 AI 중심 자동차 재고 관리 플랫폼입니다. </p></div>",
          "8": "<div><p>Metafold 3D는 클라우드 기반 플랫폼으로, 특히 첨가제 제조에 최적화 된 매우 복잡한 3D 모델의 설계 및 엔지니어링을 가능하게합니다. </p></div>"
        }
      },
      "jobs": {
        "title": {
          "1": "수석 풀 스택 개발자",
          "2": "선임 리드 프론트 엔드 개발자",
          "3": "프론트 엔드 개발자",
          "4": "프론트 엔드 개발자 인턴",
          "5": "디자이너 인턴"
        }
      }
    }
  }
}
