{
  "translation": {
    "home": {
      "sub": "นักพัฒนาเว็บสแต็คเต็มรูปแบบ",
      "section1Title": "มีประสบการณ์",
      "section1Content1": "ในบทบาทล่าสุดของฉันในฐานะนักพัฒนาสแต็คเต็มรูปแบบที่การเริ่มต้นของเทคโนโลยียา Faro Health ฉันทำงานเกี่ยวกับ Microservices ที่ใช้งานและ CQRS และโมดูล UI ที่ใช้ใน TypegreScript, Node, PostgreSQL, JEST และ React ",
      "section1Content2": "ก่อนหน้านี้ฉันได้เป็นผู้นำทีม Front End Intern Inc. ที่ Inc. ต่าง ๆ ซึ่งเราทำงานร่วมกับทีมออกแบบเพื่อปรับเปลี่ยนและโยกย้าย JavaScript มรดกและแอพสตรีมวิดีโอที่ใช้ Perl ไปยัง UI ที่ทันสมัยที่สร้างขึ้นใน React, typeScript และ Python ",
      "section2Title": "ผู้นำด้านเทคนิค",
      "section2Content1": "การมีทีมนักพัฒนาและวิศวกรระดับนานาชาติขนาดใหญ่ในสหรัฐอเมริกายุโรปไต้หวันและจีนฉันคิดว่าความเชี่ยวชาญด้านเทคโนโลยีของฉันเช่น TypeScript, Node, PostgreSQL, Jest และ React จะช่วยผลักดันองค์กรของคุณไปข้างหน้า "
    },
    "about": {
      "section1": "ไบรอันเป็นนักพัฒนาอาวุโสที่มีประสบการณ์ด้วยความหลงใหลในรหัสที่ปรับขนาดได้อย่างสง่างามและ UX ที่ใช้งานง่ายน้อยที่สุด",
      "section2": "ในเวลาว่างเขาชอบที่จะปีนเขาเล่นหมากรุกสำรวจความสกปรกของเขาและฝึกมวยไทย"
    },
    "nav": {
      "home": "บ้าน",
      "skills": "ทักษะ",
      "projects": "โครงการ",
      "about": "เกี่ยวกับ",
      "jobs": "งาน"
    },
    "data": {
      "projects": {
        "description": {
          "1": "เครื่องมือซอฟต์แวร์ทดลองทางคลินิกที่ช่วยให้นักวิจัยออกแบบและเพิ่มประสิทธิภาพการศึกษาทางคลินิกของพวกเขาโดยให้การวิเคราะห์แบบเรียลไทม์และปรับปรุงกระบวนการวางแผน",
          "2": "แอปพลิเคชันการสตรีมวิดีโอและแชทแบบเรียลไทม์",
          "3": "การสำรวจและเว็บไซต์ที่ให้ข้อมูลเกี่ยวกับการเปลี่ยนแปลงที่กำลังจะเกิดขึ้นสำหรับเมือง San Anselmo",
          "4": "เว็บไซต์สำหรับหน่วยงานออกแบบและพัฒนาเว็บ",
          "5": "หลักฐานการวิเคราะห์ข้อมูลแนวคิดแอป Micro-Service Micro ที่สร้างขึ้นในแพนด้า",
          "6": "สัญลักษณ์เดียวที่ไม่เชื่อเรื่องพระเจ้า IDP สำหรับการใช้งานสำหรับแอปพลิเคชันนักออกแบบการศึกษา",
          "7": "เว็บไซต์สำหรับแอปพลิเคชันรถยนต์มือสอง AI",
          "8": "ส่วนหน้าสำหรับแอปพลิเคชันโชว์เคสสำหรับแอปพลิเคชันทางเรขาคณิตสำหรับการรวมโครงสร้างตาข่าย"
        },
        "content": {
          "1": "<div><h3>ใช้ AI สำหรับการพัฒนาการศึกษาทางคลินิก</h3><p>ผลิตภัณฑ์เรือธงของ บริษัท คือ Faro Study Designer ได้รับการออกแบบมาเพื่อเพิ่มประสิทธิภาพและความเป็นมิตรกับผู้ป่วยของโปรโตคอลทางคลินิก</p><p>Faro Health ได้รับการลงทุนอย่างมีนัยสำคัญซึ่งได้รับเงินทุนทั้งหมด 38.3 ล้านดอลลาร์โดยมีเงินทุนจำนวน 20 ล้านเหรียญสหรัฐเมื่อประมาณสองปีที่แล้ว</p><p>คุณสมบัติที่สำคัญ ได้แก่ :</p><div><p>การทำงานร่วมกันแบบเรียลไทม์: อำนวยความสะดวกในกระบวนการเอกสารที่ถูกต้องและมีประสิทธิภาพ</p><p>การวิเคราะห์ความเป็นไปได้: ประเมินผลกระทบของการตัดสินใจออกแบบต่ออัตราความสำเร็จในการศึกษา</p><p>การเปรียบเทียบ: เปรียบเทียบโปรโตคอลกับข้อมูลในอดีตและรูปแบบการออกแบบ</p></div></div>",
          "2": "<div><p>ผู้ชมเป็นแพลตฟอร์มเว็บแคมแบบโต้ตอบที่ผู้ใช้สามารถมีส่วนร่วมในการแชทวิดีโอสดกับนักแสดงที่นำเสนอประสบการณ์แบบเรียลไทม์และเป็นส่วนตัว  </p> </div>",
          "4": "<div><p>Launch Brigade เป็นหน่วยงานออกแบบและพัฒนาเว็บไซต์ในพื้นที่อ่าวซานฟรานซิสโกซึ่งเชี่ยวชาญในการสร้างประสบการณ์ดิจิทัลที่ยกระดับแบรนด์และผลักดันการเติบโตของธุรกิจ </p></div>",
          "5": "<div><p>Data Analytics Dashboard เป็นหลักฐานของแอปพลิเคชันแนวคิดที่สร้างขึ้นในแพนด้าซึ่งใช้การออกแบบข้อมูลการศึกษาที่เก็บไว้ในสคีมาดาวเพื่อสร้าง Microservice และส่วนหน้า </p></div>",
          "7": "<div><p>Lotlinx เป็นแพลตฟอร์มการจัดการสินค้าคงคลังยานยนต์ที่ขับเคลื่อนด้วย AI ที่ใช้ประโยชน์จากการเรียนรู้ของเครื่องและการวิเคราะห์ข้อมูลที่กว้างขวางเพื่อช่วยให้ตัวแทนจำหน่ายเพิ่มประสิทธิภาพการหมุนเวียนสินค้าคงคลังและผลกำไร </p></div>",
          "8": "<div><p>Metafold 3D เป็นแพลตฟอร์มบนคลาวด์ที่ช่วยให้การออกแบบและวิศวกรรมของรุ่น 3D ที่ซับซ้อนสูงซึ่งได้รับการปรับให้เหมาะสมสำหรับการผลิตแบบเติมแต่งโดยเฉพาะ </p></div>"
        }
      },
      "jobs": {
        "title": {
          "1": "นักพัฒนาระดับสูงเต็มสแต็ค",
          "2": "นักพัฒนาระดับแนวหน้าอาวุโส",
          "3": "นักพัฒนาส่วนหน้า",
          "4": "นักพัฒนาส่วนหน้า",
          "5": "นักออกแบบฝึกงาน"
        }
      }
    }
  }
}
