{
  "translation": {
    "home": {
      "header": "<span>สวัสดีครับ!<br /> ผมชื่อ Brian Velasquez,<br /><em>นักพัฒนา Full Stack <br />.</em></span>",
      "aboutHeader": "ใครคือผม?",
      "about": "นักพัฒนาเว็บ Full Stack ระดับอาวุโสที่มีความเชี่ยวชาญใน Typescript, React, Angular, Node และ Python มีประสบการณ์ในการนำและทำงานร่วมกับทีมงานระหว่างประเทศ, การปรับปรุงแอปพลิเคชันเก่า และการพัฒนา CI/CD pipelines",
      "section1Title": "ประสบการณ์",
      "section1Content1": "ในบทบาทล่าสุดของผมในฐานะนักพัฒนา Full Stack ระดับอาวุโสที่ Faro Health สตาร์ทอัพด้านเทคโนโลยีเภสัชกรรม ผมทำงานเกี่ยวกับไมโครเซอร์วิสและโมดูล UI ที่ใช้ REST และ CQRS ที่พัฒนาใน Typescript, Node, PostgreSQL, Jest และ React งานของผมรวมถึงการพัฒนาฟีเจอร์และ POCs การออกแบบทางเทคนิค การเขียนการทดสอบแบบ Unit และ Integration การปรับปรุงประสิทธิภาพของแอปพลิเคชัน และการสร้าง Pipeline การติดตั้งด้วย Github Actions",
      "section1Content2": "ก่อนหน้านี้ผมได้เป็นผู้นำทีม Front End ระดับนานาชาติใน Various Inc. ซึ่งเราทำงานร่วมกับทีมออกแบบเพื่อเปลี่ยนผิวและย้ายแอปพลิเคชันการสตรีมวิดีโอที่ใช้ Javascript และ Perl ไปยัง UI ที่ทันสมัยซึ่งสร้างด้วย React, TypeScript และ Python โค้ดเบสที่มีความสามารถในการขยายตัวมากขึ้นโดยใช้ Next.js, MOBX และ WebSockets และมีการสนับสนุนจาก REST APIs และ CI/CD development pipeline เพื่อช่วยในการติดตั้ง",
      "section2Title": "ผู้นำทางเทคนิค",
      "section2Content1": "จากประสบการณ์ในการนำทีมพัฒนาระดับนานาชาติในสหรัฐอเมริกา, ยุโรป, ไต้หวัน และจีน ผมมั่นใจว่า ความเชี่ยวชาญของผมในเทคโนโลยีต่างๆ เช่น Typescript, Node, PostgreSQL, Jest และ React จะช่วยพัฒนาองค์กรของคุณไปข้างหน้า นอกจากทักษะในการออกแบบและพัฒนาแล้ว ความสามารถในการเป็นผู้นำของผมจะช่วยประสานงานและมุ่งเน้นความพยายามของทีมไปยังเป้าหมายและการบรรลุเป้าหมายของบริษัท"
    },
    "about": {
      "section1": "Brian เป็นนักพัฒนาระดับ Senior ที่มีประสบการณ์และหลงใหลในการเขียนโค้ดที่สวยงามและสามารถขยายได้ รวมถึง UX ที่ใช้งานง่ายและมีน้อย",
      "section2": "ในเวลาว่างเขาชอบปีนเขา เล่นหมากรุก ขี่จักรยานลุยโคลน และฝึกมวยไทย"
    },
    "lang": {
      "english": "อังกฤษ",
      "chinese": "จีน",
      "espanol": "สเปน",
      "thai": "ไทย",
      "german": "เยอรมัน",
      "korean": "เกาหลี"
    },
    "nav": {
      "home": "หน้าแรก",
      "skills": "ทักษะ",
      "projects": "โครงการ",
      "about": "เกี่ยวกับฉัน",
      "jobs": "งาน"
    },
    "jobs": {
      "content": {
        "5": "",
        "4": "",
        "3": "",
        "2": "",
        "1": ""
      }
    },
    "data": {
      "projects": {
        "description": {
          "1": "เครื่องมือซอฟต์แวร์สำหรับการทดลองทางคลินิกเพื่อวางแผน ออกแบบ และเพิ่มประสิทธิภาพการศึกษา พร้อมการวิเคราะห์แบบเรียลไทม์",
          "2": "แอปพลิเคชันสตรีมมิ่งวิดีโอและแชทแบบเรียลไทม์",
          "3": "เว็บไซต์สำรวจและข้อมูลเกี่ยวกับการเปลี่ยนแปลงที่จะเกิดขึ้นในเมือง San Anselmo",
          "4": "เว็บไซต์สำหรับเอเจนซี่ออกแบบและพัฒนาเว็บ",
          "5": "แอปพลิเคชัน Proof of Concept สำหรับบริการไมโครเซอร์วิสการวิเคราะห์ข้อมูลที่สร้างใน Python และ Pandas",
          "6": "การใช้งาน Single Sign-On แบบไม่ขึ้นกับ IDP สำหรับแอปพลิเคชันออกแบบการศึกษา",
          "7": "เว็บไซต์สำหรับแอปพลิเคชันรถยนต์มือสองที่ใช้ AI",
          "8": "Frontend สำหรับแอปพลิเคชันสาธิตสำหรับแอปพลิเคชันเชิงเรขาคณิตที่รวมโครงสร้างตะแกรง"
        },
        "content": {
          "1": "<div><h3>การใช้ AI สำหรับการพัฒนาการศึกษาในทางคลินิก</h3><p>ผลิตภัณฑ์เรือธงของบริษัท Faro Study Designer ถูกออกแบบมาเพื่อเพิ่มประสิทธิภาพและความสะดวกในการใช้งานของโปรโตคอลทางคลินิก</p><p>Faro Health ได้รับการลงทุนอย่างมีนัยสำคัญ โดยได้รับเงินทุนรวม 38.3 ล้านดอลลาร์ โดยล่าสุดมีการระดมทุน 20 ล้านดอลลาร์เมื่อประมาณสองปีที่แล้ว</p><p>คุณสมบัติหลักประกอบด้วย:</p><ul><li>การทำงานร่วมกันแบบเรียลไทม์: ช่วยให้กระบวนการเอกสารแม่นยำและมีประสิทธิภาพ</li><li>การวิเคราะห์ความเป็นไปได้: ประเมินผลกระทบของการตัดสินใจด้านการออกแบบต่ออัตราความสำเร็จของการศึกษา</li><li>การเปรียบเทียบมาตรฐาน: เปรียบเทียบโปรโตคอลกับข้อมูลประวัติศาสตร์และการเปลี่ยนแปลงการออกแบบ</li></ul></div>",
          "2": "<p>The Viewer เป็นแพลตฟอร์มกล้องเว็บอินเตอร์แอคทีฟที่ผู้ใช้สามารถมีส่วนร่วมในแชทวิดีโอสดกับผู้แสดงผล โดยให้ประสบการณ์ที่เป็นส่วนตัวแบบเรียลไทม์ แพลตฟอร์มนี้ช่วยให้ผู้ใช้สามารถดูการถ่ายทอดสด มีส่วนร่วมในเซสชั่นส่วนตัว และเชื่อมต่อกับผู้แสดงผลผ่านวิดีโอ เสียง และฟังก์ชันแชท</p>",
          "4": "<p>Launch Brigade เป็นเอเจนซี่ออกแบบและพัฒนาเว็บไซต์ที่ตั้งอยู่ในพื้นที่อ่าวซานฟรานซิสโก เชี่ยวชาญในการสร้างประสบการณ์ดิจิทัลที่ยกระดับแบรนด์และขับเคลื่อนการเติบโตทางธุรกิจ เว็บไซต์ของพวกเขา launchbrigade.com แสดงถึงความมุ่งมั่นของพวกเขาในการให้บริการโซลูชันดิจิทัลที่ครอบคลุม</p>",
          "5": "<p>แดชบอร์ดการวิเคราะห์ข้อมูลคือแอปพลิเคชัน Proof of Concept ที่สร้างใน Pandas ซึ่งใช้ข้อมูลการออกแบบการศึกษาในสคีมาสตาร์เพื่อสร้างบริการไมโครเซอร์วิสการวิเคราะห์ข้อมูลและส่วนหน้าที่เชื่อมต่อแอปพลิเคชันนี้ช่วยให้ผู้ใช้สามารถเลือกและวิเคราะห์ข้อมูลการศึกษาได้ตามมิติข้อมูลที่เลือก</p>",
          "6": "<p>การใช้งาน Single Sign-On แบบไม่ขึ้นกับ IDP สำหรับแอปพลิเคชันออกแบบการศึกษา สร้างขึ้นเพื่อให้สามารถใช้งานได้กับองค์กรที่แตกต่างกันโดยใช้บริการ SAML และ Oauth ของผู้ให้บริการตัวตนในการให้โทเค็นสำหรับการโต้ตอบกับ API ของเรา</p>",
          "7": "<p>Lotlinx คือแพลตฟอร์มการจัดการสินค้าคงคลังของรถยนต์ที่ขับเคลื่อนด้วย AI ซึ่งใช้การเรียนรู้ของเครื่องและการวิเคราะห์ข้อมูลเชิงลึกเพื่อช่วยให้ตัวแทนจำหน่ายสามารถเพิ่มประสิทธิภาพการหมุนเวียนสินค้าคงคลังและผลกำไรได้ โดยการให้ข้อมูลเชิงลึกที่เป็นจริงเกี่ยวกับความต้องการของตลาด กลยุทธ์การตั้งราคา และพฤติกรรมของผู้บริโภค</p>",
          "8": "<p>Metafold 3D เป็นแพลตฟอร์มคลาวด์ที่ช่วยให้สามารถออกแบบและวิศวกรรมโมเดล 3D ที่มีความซับซ้อนสูง โดยเฉพาะที่ได้รับการปรับให้เหมาะสมสำหรับการผลิตแบบเติมเนื้อวัสดุ Metafold 3D แก้ปัญหาที่เครื่องมือ CAD แบบดั้งเดิมพบเมื่อจัดการกับเรขาคณิตที่ซับซ้อน เช่น โครงสร้างตะแกรงซึ่งจำเป็นสำหรับการออกแบบที่เบาและมีประสิทธิภาพ</p>"
        }
      },
      "jobs": {
        "title": {
          "1": "นักพัฒนา Full-Stack ระดับ Senior",
          "2": "หัวหน้านักพัฒนา Front-End ระดับ Senior",
          "3": "นักพัฒนา Front-End",
          "4": "นักพัฒนา Front-End ฝึกงาน",
          "5": "นักออกแบบฝึกงาน"
        }
      }
    }
  }
}
