{
  "translation": {
    "home": {
      "header": "<span>สวัสดี!<br /> ฉันคือ Brian Velasquez,<br /><em>Senior Full Stack <br />Engineer.</em></span>",
      "aboutHeader": "ฉันคือใคร?",
      "about": "Senior Full-Stack Web Developer ที่มีความเชี่ยวชาญใน TypeScript, React, Angular, Node.js และ Python มีประสบการณ์ในการเป็นผู้นำทีมระหว่างประเทศ การพัฒนาระบบเก่าให้ทันสมัย การปรับปรุงสถาปัตยกรรม และการนำเสนอ CI/CD pipelines สำหรับการปรับใช้ที่มีประสิทธิภาพ มีความหลงใหลในการสร้างโซลูชันที่สามารถขยายได้และเน้นผู้ใช้ ซึ่งช่วยผลักดันการเติบโตของธุรกิจ",
      "section1Title": "มีประสบการณ์",
      "section1Content1": "ในตำแหน่งล่าสุดของฉันในฐานะ Senior Full-Stack Developer ที่ Faro Health สตาร์ทอัพทางเทคโนโลยีด้านเภสัชกรรม ฉันได้สร้างและปรับปรุง REST และ CQRS-based microservices และ UI modules โดยใช้ TypeScript, Node.js, PostgreSQL, Jest และ React ฉันได้พัฒนา feature slices และ POCs ออกแบบและดำเนินการแก้ปัญหาทางเทคนิค เขียนการทดสอบหน่วยและการทดสอบการรวมกัน ปรับปรุงประสิทธิภาพของแอปพลิเคชัน และสร้าง deployment pipelines ด้วย GitHub Actions",
      "section1Content2": "ก่อนหน้านี้ ฉันได้เป็นผู้นำทีม front-end ระหว่างประเทศที่ Various Inc. โดยร่วมงานใกล้ชิดกับนักออกแบบเพื่อทำให้แอปพลิเคชันการสตรีมวิดีโอที่ใช้ JavaScript และ Perl เก่าให้ทันสมัย เราได้ย้ายแอปพลิเคชันเหล่านี้ไปยังสแต็ก React และ TypeScript ที่สามารถขยายได้และมีประสิทธิภาพสูง โดยใช้ Next.js, MOBX, WebSockets และ Python ซึ่งรองรับด้วย REST APIs และ CI/CD pipeline สำหรับการปรับใช้ที่ไร้รอยต่อ",
      "section2Title": "ผู้นำทางเทคนิค",
      "section2Content1": "ในการนำทีมระหว่างประเทศขนาดใหญ่ที่ครอบคลุมสหรัฐอเมริกา, ยุโรป, ไต้หวัน และจีน ฉันนำความเชี่ยวชาญลึกใน TypeScript, Node.js, PostgreSQL, Jest และ React เพื่อขับเคลื่อนนวัตกรรม นอกเหนือจากการออกแบบและพัฒนาเทคนิคแล้ว ทักษะการเป็นผู้นำของฉันยังทำให้ทีมทำงานได้ตรงตามเป้าหมายและมุ่งไปข้างหน้าอย่างมีประสิทธิภาพ"
    },
    "about": {
      "section1": "Brian เป็น Senior Developer ที่มีประสบการณ์และมีความหลงใหลในโค้ดที่สวยงามและสามารถขยายได้ และ UX ที่ใช้งานง่ายและตรงไปตรงมา",
      "section2": "ในเวลาว่างเขาชอบปีนเขา เล่นหมากรุก ขี่จักรยานลุยและฝึกมวยไทย"
    },
    "lang": {
      "english": "อังกฤษ",
      "chinese": "จีน",
      "espanol": "สเปน",
      "thai": "ไทย",
      "german": "เยอรมัน",
      "korean": "เกาหลี"
    },
    "nav": {
      "home": "หน้าหลัก",
      "skills": "ทักษะ",
      "projects": "โปรเจ็กต์",
      "about": "เกี่ยวกับ",
      "jobs": "งาน"
    },
    "jobs": {
      "content": {
        "5": "",
        "4": "",
        "3": "",
        "2": "",
        "1": ""
      }
    },
    "data": {
      "projects": {
        "description": {
          "1": "เครื่องมือซอฟต์แวร์สำหรับการทดลองทางคลินิกเพื่อการวางแผน ออกแบบ และปรับแต่งการศึกษาด้วยการวิเคราะห์แบบเรียลไทม์",
          "2": "แอปพลิเคชันการสตรีมวิดีโอและแชทแบบเรียลไทม์",
          "3": "เว็บไซต์สำรวจและข้อมูลเกี่ยวกับการเปลี่ยนแปลงที่จะเกิดขึ้นในเมือง San Anselmo",
          "4": "เว็บไซต์สำหรับบริษัทออกแบบและพัฒนาเว็บไซต์",
          "5": "Proof of concept Data Analytics micro-service app ที่สร้างใน Python และ Pandas",
          "6": "การนำ Single Sign On ที่ไม่ผูกพันกับ IDP สำหรับแอปพลิเคชันการออกแบบการศึกษา",
          "7": "เว็บไซต์สำหรับแอปพลิเคชัน AI ที่ใช้ในการจัดการรถยนต์มือสอง",
          "8": "ส่วนหน้าสำหรับแอปพลิเคชันที่แสดงสำหรับแอปพลิเคชันทางเรขาคณิตในการรวมโครงสร้างลattice"
        },
        "content": {
          "1": "<div><h3>การใช้ AI ในการพัฒนาการศึกษาทางคลินิก</h3><p>ผลิตภัณฑ์หลักของบริษัท Faro Study Designer ถูกออกแบบมาเพื่อเพิ่มประสิทธิภาพและความสะดวกสบายในการใช้งานสำหรับโปรโตคอลทางคลินิก</p><p>Faro Health ได้รับการลงทุนจำนวนมาก โดยมีเงินทุนทั้งหมด $38.3 ล้านดอลลาร์ โดยเงินทุนล่าสุด $20 ล้านดอลลาร์ถูกระดมเมื่อประมาณสองปีที่แล้ว</p><p>คุณสมบัติหลัก ได้แก่:</p><ul><li>การทำงานร่วมกันแบบเรียลไทม์: ช่วยให้กระบวนการเอกสารแม่นยำและมีประสิทธิภาพ</li><li>การวิเคราะห์ความเป็นไปได้: ประเมินผลกระทบของการตัดสินใจออกแบบต่ออัตราความสำเร็จของการศึกษา</li><li>การเปรียบเทียบข้อมูล: เปรียบเทียบโปรโตคอลกับข้อมูลประวัติและการออกแบบที่แตกต่างกัน</li></ul></div>",
          "2": "<p>The Viewer เป็นแพลตฟอร์มเว็บแคมที่ให้ผู้ใช้สามารถมีส่วนร่วมในการแชทสดกับผู้แสดง โดยให้ประสบการณ์ส่วนตัวแบบเรียลไทม์ แพลตฟอร์มนี้ช่วยให้ผู้ใช้สามารถดูการถ่ายทอดสด เข้าร่วมเซสชันส่วนตัว และเชื่อมต่อกับผู้แสดงผ่านวิดีโอ เสียง และฟีเจอร์แชท</p>",
          "3": "<p>เว็บไซต์ WordPress สำหรับการอัปเดตแผนทั่วไป San Anselmo 2025 ซึ่งให้ข้อมูลครบถ้วนแก่ผู้อยู่อาศัยเกี่ยวกับการเปลี่ยนแปลงที่เสนอในโครงสร้างพื้นฐาน เขตการใช้ที่ดิน และพื้นที่สาธารณะของเมือง รวมถึงการอัปเดตโครงการต่างๆ ความยั่งยืน และการปรับปรุงการขนส่ง เว็บไซต์นี้ยังมีการสำรวจสาธารณะแบบโต้ตอบ ซึ่งให้ชุมชนมีส่วนร่วมในการตัดสินใจ</p>",
          "4": "<p>Launch Brigade เป็นบริษัทออกแบบและพัฒนาเว็บไซต์ที่ตั้งอยู่ในพื้นที่อ่าวซานฟรานซิสโก ซึ่งเชี่ยวชาญในการสร้างประสบการณ์ดิจิทัลที่ยกระดับแบรนด์และส่งเสริมการเติบโตของธุรกิจ เว็บไซต์ของพวกเขาคือ launchbrigade.com ซึ่งสะท้อนถึงความมุ่งมั่นในการส่งมอบโซลูชันดิจิทัลที่ครบวงจร</p>",
          "5": "<p>The Data Analytics Dashboard เป็นแอปพลิเคชัน proof of concept ที่สร้างใน Pandas ซึ่งใช้ข้อมูลการออกแบบการศึกษาใน star schema เพื่อสร้าง microservice ด้านการวิเคราะห์ข้อมูลและส่วนหน้าสำหรับผู้ใช้ในการจัดการข้อมูลการศึกษาของพวกเขาตามมิติข้อมูลที่เลือก</p>",
          "6": "<p>การนำ Single Sign On ที่ไม่ผูกพันกับ IDP สำหรับแอปพลิเคชันการออกแบบการศึกษา ซึ่งสร้างขึ้นเพื่อให้องค์กรต่างๆ สามารถใช้บริการผู้ให้บริการตัวตน SAML และ Oauth ของตนเองในการให้โทเค็นเพื่อเชื่อมต่อกับ API ของเรา</p>",
          "7": "<p>Lotlinx เป็นแพลตฟอร์มการจัดการสินค้าคงคลังรถยนต์ที่ขับเคลื่อนด้วย AI ซึ่งใช้การเรียนรู้ของเครื่องและการวิเคราะห์ข้อมูลเพื่อช่วยให้ตัวแทนจำหน่ายปรับปรุงการหมุนเวียนสินค้าคงคลังและความสามารถในการทำกำไร</p>",
          "8": "<p>Metafold 3D เป็นแพลตฟอร์มบนคลาวด์ที่ช่วยให้การออกแบบและวิศวกรรมโมเดล 3 มิติที่ซับซ้อนได้ ซึ่งได้รับการปรับแต่งเพื่อการผลิตแบบเพิ่มขึ้น ก่อตั้งขึ้นในปี 2020 โดยผู้เชี่ยวชาญในสาขาคณิตศาสตร์ เรขาคณิต และสถาปัตยกรรม</p>"
        }
      },
      "jobs": {
        "title": {
          "1": "Senior Full-Stack Developer",
          "2": "Senior Lead Front-end Developer",
          "3": "Front-end Developer",
          "4": "Front-end Developer Intern",
          "5": "Designer Intern"
        }
      }
    }
  }
}
